import React from "react";

export default function text () {
    return (
        <textarea className="TermsofUse" rows="4" cols="100" readOnly>      
         [북적북적](이하 "사이트"라 함)은 개인정보 보호법에 따라 이용자의 개인정보 보호 및 권익을 보호하고 개인정보와 관련한 이용자의 고충을 원활하게 처리할 수 있도록 다음과 같은 처리방침을 두고 있습니다.

1. 개인정보의 수집 목적 및 이용 목적
- 회원 가입 및 관리: 회원 가입 의사 확인, 회원제 서비스 제공에 따른 본인 식별·인증, 회원 자격 유지·관리, 서비스 부정 이용 방지, 각종 고지·통지, 고충 처리 등
- 서비스 제공: 도서 대여 및 관련 서비스 제공, 콘텐츠 제공, 맞춤 서비스 제공, 본인 인증, 연령 인증
- 고객 상담 및 민원 처리: 민원인의 신원 확인, 민원 사항 확인, 사실 조사를 위한 연락·통지, 처리 결과 통보

2. 수집하는 개인정보의 항목
- 필수 항목: 이름, 생년월일, 성별, 로그인 ID, 비밀번호, 전화번호, 주소, 이메일, 결제 정보(신용카드 정보 등)
- 선택 항목: 관심 도서, 대여 이력, 기타 개인 맞춤형 서비스 제공을 위한 정보

3. 개인정보의 보유 및 이용 기간
- 회원 탈퇴 시까지 보유 및 이용. 단, 관계 법령에 따라 보관할 필요가 있는 경우 해당 법령에서 정한 기간 동안 보관

4. 개인정보의 제3자 제공에 관한 사항
- 사이트는 이용자의 개인정보를 원칙적으로 외부에 제공하지 않습니다. 다만, 이용자의 동의가 있거나 법령의 규정에 의거해 적법하게 제3자에게 제공할 경우는 예외로 합니다.

5. 개인정보의 파기 절차 및 방법
- 파기 절차: 이용자가 입력한 정보는 목적 달성 후 별도의 DB에 옮겨져 내부 방침 및 기타 관련 법령에 따라 일정 기간 저장된 후 파기됩니다.
- 파기 방법: 전자적 파일 형태의 정보는 기록을 재생할 수 없는 기술적 방법을 사용하여 삭제하며, 종이 문서에 기록된 개인정보는 분쇄기로 분쇄하거나 소각하여 파기합니다.

6. 이용자의 권리와 그 행사 방법
- 이용자는 언제든지 등록되어 있는 자신의 개인정보를 조회하거나 수정할 수 있으며, 개인정보의 처리 정지 및 삭제를 요청할 수 있습니다.
- 권리 행사는 서면, 전화, 이메일 등을 통해 하실 수 있으며, 사이트는 이에 대해 지체 없이 조치하겠습니다.

7. 개인정보의 안전성 확보 조치
- 개인정보의 암호화, 해킹 등에 대비한 기술적 대책, 접근 통제 및 접근 권한 제한, 개인정보 취급 직원의 최소화 및 교육 등

8. 개인정보 보호책임자
- 이름: [김태형]
- 직책: 개인정보 보호책임자
- 연락처: [010-0000-0000], [qweasd123@gmail.com]

이 방침은 2024년 7월 17일부터 시행됩니다.
     </textarea>
    )
}